export const ChromeDevToolsQuestions = [
  {
    id: 1,
    question: 'Что такое Chrome Dev Tools и для чего они используются?',
    level: 'MID',
  },
  {
    id: 2,
    question: 'Как открыть и начать использовать Chrome Dev Tools в браузере?',
    level: 'MID',
  },
  {
    id: 3,
    question: 'Как использовать вкладку Network для анализа сетевого трафика?',
    level: 'MID',
  },
  {
    id: 4,
    question:
      'Какие данные можно собирать на вкладке Network (время загрузки, статус код, размер и т.д.)?',
    level: 'MID',
  },
  {
    id: 5,
    question:
      'Как фильтровать запросы в Chrome Dev Tools по типу (XHR, JS, CSS и т.д.)?',
    level: 'MID',
  },
  {
    id: 6,
    question:
      'Как отслеживать время загрузки веб-страницы с помощью вкладки Network?',
    level: 'MID',
  },
  {
    id: 7,
    question:
      'Как работать с запросами и ответами HTTP на вкладке Network (просмотр, копирование и повторное выполнение запросов)?',
    level: 'MID',
  },
  {
    id: 8,
    question:
      'Как анализировать и устранять ошибки CORS с использованием Chrome Dev Tools?',
    level: 'MID',
  },
  {
    id: 9,
    question:
      'Что такое waterfall диаграмма и как ее интерпретировать для анализа производительности сайта?',
    level: 'MID',
  },
  {
    id: 10,
    question:
      'Как измерять и анализировать время ответа сервера с помощью Chrome Dev Tools?',
    level: 'MID',
  },
  {
    id: 11,
    question:
      'Как использовать вкладку Performance для анализа производительности рендеринга и JavaScript?',
    level: 'MID',
  },
  {
    id: 12,
    question:
      'Как отслеживать загрузку ресурсов (картинки, стили, скрипты) и их влияние на производительность?',
    level: 'MID',
  },
  {
    id: 13,
    question:
      'Как просматривать заголовки запросов и ответов HTTP с помощью Chrome Dev Tools?',
    level: 'MID',
  },
  {
    id: 14,
    question:
      'Как использовать вкладку Timeline для анализа активности на странице?',
    level: 'MID',
  },
  {
    id: 15,
    question:
      'Как анализировать и оптимизировать использование JavaScript с помощью вкладки Sources?',
    level: 'MID',
  },
  {
    id: 16,
    question:
      'Как отлаживать JavaScript-код с использованием Chrome Dev Tools (точки останова, пошаговое выполнение)?',
    level: 'MID',
  },
  {
    id: 17,
    question:
      'Как анализировать WebSocket соединения с помощью Chrome Dev Tools?',
    level: 'MID',
  },
  {
    id: 18,
    question:
      'Как просматривать и анализировать состояние кэша для оптимизации загрузки страниц?',
    level: 'MID',
  },
  {
    id: 19,
    question:
      'Как использовать вкладку Security для анализа сертификатов SSL и шифрования соединений?',
    level: 'MID',
  },
  {
    id: 20,
    question:
      'Как записывать и воспроизводить сетевые запросы с использованием инструмента HAR в Chrome Dev Tools?',
    level: 'MID',
  },
  {
    id: 21,
    question:
      'Как анализировать производительность сайта при медленных сетевых соединениях (использование профилирования сети)?',
    level: 'MID',
  },
  {
    id: 22,
    question:
      'Как использовать симуляцию медленных сетей и устройств с низкой производительностью для тестирования?',
    level: 'MID',
  },
  {
    id: 23,
    question:
      'Как работать с панелью Application для управления локальным хранилищем, куками и другими веб-данными?',
    level: 'MID',
  },
  {
    id: 24,
    question:
      'Как анализировать поток данных на уровне HTTP/2 с помощью Chrome Dev Tools?',
    level: 'MID',
  },
  {
    id: 25,
    question:
      'Какие инструменты Chrome Dev Tools можно использовать для профилирования производительности на мобильных устройствах?',
    level: 'MID',
  },
  {
    id: 26,
    question:
      'Как использовать панель Lighthouse для аудита производительности и SEO-оптимизации сайта?',
    level: 'MID',
  },
  {
    id: 27,
    question:
      'Как сохранить и экспортировать логи сети и производительности для дальнейшего анализа?',
    level: 'MID',
  },
  {
    id: 28,
    question:
      'Как отслеживать выполнение синхронных и асинхронных операций в JavaScript с помощью вкладки Sources?',
    level: 'MID',
  },
  {
    id: 29,
    question:
      'Как снимать и анализировать снимки стека вызовов (stack traces) в процессе выполнения JavaScript?',
    level: 'MID',
  },
  {
    id: 30,
    question:
      'Как использовать панель Memory для анализа утечек памяти и оптимизации использования памяти на веб-странице?',
    level: 'MID',
  },
];
