export const LinuxCommandsQuestions = [
  {
    id: 1,
    question: 'Что такое командная строка Linux и для чего она используется?',
    level: 'JUNIOR',
  },
  {
    id: 2,
    question: 'Как узнать текущую директорию с помощью команды в Linux?',
    level: 'JUNIOR',
  },
  {
    id: 3,
    question:
      'Как создать новый файл или директорию с помощью команд `touch` и `mkdir`?',
    level: 'JUNIOR',
  },
  {
    id: 4,
    question: 'Как просмотреть содержимое директории с помощью команды `ls`?',
    level: 'JUNIOR',
  },
  {
    id: 5,
    question: 'Как перемещаться между директориями с помощью команды `cd`?',
    level: 'JUNIOR',
  },
  {
    id: 6,
    question:
      'Как копировать файлы и директории с использованием команды `cp`?',
    level: 'JUNIOR',
  },
  {
    id: 7,
    question:
      'Как перемещать или переименовывать файлы с помощью команды `mv`?',
    level: 'JUNIOR',
  },
  {
    id: 8,
    question: 'Как удалять файлы и директории с помощью команд `rm` и `rmdir`?',
    level: 'JUNIOR',
  },
  {
    id: 9,
    question:
      'Как просмотреть содержимое файла с использованием команд `cat`, `less`, `more` и `head`?',
    level: 'JUNIOR',
  },
  {
    id: 10,
    question:
      'Как найти файлы или текст в файлах с использованием команд `find` и `grep`?',
    level: 'JUNIOR',
  },
  {
    id: 11,
    question:
      'Что такое права доступа к файлам и как использовать команду `chmod` для их изменения?',
    level: 'JUNIOR',
  },
  {
    id: 12,
    question:
      'Как изменить владельца файла или директории с помощью команды `chown`?',
    level: 'JUNIOR',
  },
  {
    id: 13,
    question: 'Как узнать информацию о системе с помощью команды `uname`?',
    level: 'JUNIOR',
  },
  {
    id: 14,
    question:
      'Как вывести информацию о размере файлов и директориях с помощью команды `du`?',
    level: 'JUNIOR',
  },
  {
    id: 15,
    question:
      'Как узнать, сколько места на диске занимает система, используя команду `df`?',
    level: 'JUNIOR',
  },
  {
    id: 16,
    question: 'Как посмотреть активные процессы с помощью команды `ps`?',
    level: 'JUNIOR',
  },
  {
    id: 17,
    question: 'Как завершить процесс с помощью команды `kill`?',
    level: 'JUNIOR',
  },
  {
    id: 18,
    question:
      'Как мониторить использование системных ресурсов с помощью команды `top`?',
    level: 'JUNIOR',
  },
  {
    id: 19,
    question:
      'Как работать с пакетами программ в дистрибутивах на основе Debian с использованием команды `apt`?',
    level: 'JUNIOR',
  },
  {
    id: 20,
    question:
      'Как установить, обновить или удалить программы с помощью команды `yum` или `dnf` в системах на базе RedHat?',
    level: 'JUNIOR',
  },
  {
    id: 21,
    question:
      'Как узнать текущих пользователей системы с помощью команды `who`?',
    level: 'JUNIOR',
  },
  {
    id: 22,
    question:
      'Как управлять пользователями и группами с помощью команд `useradd`, `usermod` и `groupadd`?',
    level: 'JUNIOR',
  },
  {
    id: 23,
    question:
      'Как сменить пользователя или получить права суперпользователя с помощью команды `su` или `sudo`?',
    level: 'JUNIOR',
  },
  {
    id: 24,
    question:
      'Как просмотреть содержимое системных логов с помощью команды `journalctl` или `dmesg`?',
    level: 'JUNIOR',
  },
  {
    id: 25,
    question:
      'Как управлять службами и демонами с помощью команды `systemctl`?',
    level: 'JUNIOR',
  },
  {
    id: 26,
    question: 'Как архивировать файлы с помощью команды `tar`?',
    level: 'JUNIOR',
  },
  {
    id: 27,
    question: 'Как сжать файлы с помощью команд `gzip`, `bzip2` и `zip`?',
    level: 'JUNIOR',
  },
  {
    id: 28,
    question: 'Как скачать файлы с использованием команд `wget` и `curl`?',
    level: 'JUNIOR',
  },
  {
    id: 29,
    question: 'Как настроить SSH-соединение с использованием команды `ssh`?',
    level: 'JUNIOR',
  },
  {
    id: 30,
    question:
      'Как скопировать файлы между удаленными системами с использованием команды `scp`?',
    level: 'JUNIOR',
  },
  {
    id: 31,
    question:
      'Как узнать информацию о сетевых интерфейсах с помощью команды `ifconfig` или `ip`?',
    level: 'JUNIOR',
  },
  {
    id: 32,
    question:
      'Как настроить сетевые интерфейсы в Linux с использованием команды `ip`?',
    level: 'JUNIOR',
  },
  {
    id: 33,
    question: 'Как проверить сетевое соединение с помощью команды `ping`?',
    level: 'JUNIOR',
  },
  {
    id: 34,
    question:
      'Как определить маршрут пакетов до удаленного хоста с помощью команды `traceroute` или `tracepath`?',
    level: 'JUNIOR',
  },
  {
    id: 35,
    question:
      'Как посмотреть открытые сетевые порты с использованием команды `netstat` или `ss`?',
    level: 'JUNIOR',
  },
  {
    id: 36,
    question:
      'Как выполнять плановые задачи с использованием команды `crontab`?',
    level: 'JUNIOR',
  },
  {
    id: 37,
    question:
      'Как использовать команду `rsync` для синхронизации файлов и папок между системами?',
    level: 'JUNIOR',
  },
  {
    id: 38,
    question: 'Как найти недавно измененные файлы с помощью команды `find`?',
    level: 'JUNIOR',
  },
  {
    id: 39,
    question:
      'Как записывать и воспроизводить команды с помощью команды `script`?',
    level: 'JUNIOR',
  },
  {
    id: 40,
    question:
      'Как работать с жесткими и символическими ссылками в Linux с помощью команд `ln`?',
    level: 'JUNIOR',
  },
  {
    id: 41,
    question:
      'Как включить или отключить интерфейс сети с использованием команды `ifdown` и `ifup`?',
    level: 'JUNIOR',
  },
  {
    id: 42,
    question:
      'Как посмотреть историю введенных команд с использованием команды `history`?',
    level: 'JUNIOR',
  },
  {
    id: 43,
    question:
      'Как использовать команду `alias` для создания кратких имен команд?',
    level: 'JUNIOR',
  },
  {
    id: 44,
    question:
      'Как управлять правами доступа на чтение, запись и выполнение с помощью команд `chmod` и `umask`?',
    level: 'JUNIOR',
  },
  {
    id: 45,
    question:
      'Как проверить и восстановить файловую систему с использованием команд `fsck`?',
    level: 'JUNIOR',
  },
  {
    id: 46,
    question:
      'Как управлять жесткими дисками и файловыми системами с помощью команды `fdisk` и `mkfs`?',
    level: 'JUNIOR',
  },
  {
    id: 47,
    question:
      'Как отобразить информацию о текущем пользователе и его окружении с помощью команды `id`?',
    level: 'JUNIOR',
  },
  {
    id: 48,
    question:
      'Как установить или изменить переменные окружения с помощью команды `export`?',
    level: 'JUNIOR',
  },
  {
    id: 49,
    question:
      'Как отслеживать системные события и процессы с помощью команды `htop`?',
    level: 'JUNIOR',
  },
  {
    id: 50,
    question:
      'Как настроить права доступа для пользователя к файлам и каталогам с помощью `ACL` (Access Control List)?',
    level: 'JUNIOR',
  },
];
