export const OsiModelQuestions = [
  {
    id: 1,
    question: 'Что такое модель OSI и для чего она используется?',
    level: 'JUNIOR',
  },
  {
    id: 2,
    question: 'Какие уровни входят в модель OSI?',
    level: 'JUNIOR',
  },
  {
    id: 3,
    question: 'Какова функция физического уровня модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 4,
    question: 'Что происходит на канальном уровне модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 5,
    question: 'Какие задачи выполняет сетевой уровень модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 6,
    question:
      'Что такое транспортный уровень и для чего он используется в модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 7,
    question:
      'Какой уровень модели OSI отвечает за установление, управление и завершение сеансов связи?',
    level: 'JUNIOR',
  },
  {
    id: 8,
    question: 'Что делает презентационный уровень в модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 9,
    question: 'Какие задачи решает прикладной уровень модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 10,
    question: 'Как взаимодействуют уровни модели OSI друг с другом?',
    level: 'JUNIOR',
  },
  {
    id: 11,
    question: 'Какие протоколы работают на транспортном уровне модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 12,
    question: 'Какие протоколы относятся к прикладному уровню модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 13,
    question: 'Как сетевой уровень модели OSI управляет маршрутизацией данных?',
    level: 'JUNIOR',
  },
  {
    id: 14,
    question: 'Какие протоколы работают на сетевом уровне модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 15,
    question:
      'Что такое MAC-адрес, и как он используется на канальном уровне OSI?',
    level: 'JUNIOR',
  },
  {
    id: 16,
    question: 'Какую роль играет IP-адрес на сетевом уровне модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 17,
    question: 'Чем отличается модель OSI от модели TCP/IP?',
    level: 'JUNIOR',
  },
  {
    id: 18,
    question: 'Какие устройства работают на физическом уровне модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 19,
    question:
      'Как работают маршрутизаторы и на каком уровне OSI они функционируют?',
    level: 'JUNIOR',
  },
  {
    id: 20,
    question: 'На каком уровне модели OSI работают коммутаторы (switches)?',
    level: 'JUNIOR',
  },
  {
    id: 21,
    question:
      'Какой уровень модели OSI отвечает за кодирование и преобразование данных?',
    level: 'JUNIOR',
  },
  {
    id: 22,
    question:
      'Как происходит управление потоком данных на транспортном уровне модели OSI?',
    level: 'JUNIOR',
  },
  {
    id: 23,
    question:
      'Какие технологии используются на канальном уровне модели OSI для обнаружения ошибок?',
    level: 'JUNIOR',
  },
  {
    id: 24,
    question:
      'Какая роль пакетов и фреймов в модели OSI и на каких уровнях они используются?',
    level: 'JUNIOR',
  },
  {
    id: 25,
    question: 'Как модели OSI и TCP/IP взаимодействуют в современных сетях?',
    level: 'JUNIOR',
  },
];
